src/Documents/ПЗТ_ЗадачаПользователяТелеграм/ПЗТ_ЗадачаПользователяТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПЗТ_ЗадачаПользователяТелеграм</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ПЗТ_СтатусыЗадачиПользователяТелеграм</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПЗТ_ПриоритетЗадачиТелеграм</types>
    </type>
  </attributes>
  <attributes>
    <name>ТокенБота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ПЗТ_СтатусыЗадачиПользователяТелеграм/ПЗТ_СтатусыЗадачиПользователяТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПЗТ_СтатусыЗадачиПользователяТелеграм</name>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Бэклог</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>НеБудетВыполнена</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ПЗТ_ПриоритетЗадачиТелеграм/ПЗТ_ПриоритетЗадачиТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПЗТ_ПриоритетЗадачиТелеграм</name>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПЗТ_ЗадачаПользователяТелеграм/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		
		Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ПЗТ_СтатусыЗадачиПользователяТелеграм.Создана");							
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Приоритет) Тогда
		
		Приоритет = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ПЗТ_ПриоритетЗадачиТелеграм.Средний");;
		
	КонецЕсли;
 
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КраткоеОписаниеЗадачи = ОписаниеЗадачи;
	
	УстановитьПризнакПоставитьЗадачуКОтправкеПередЗаписью();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство(СвойствоПоставитьЗадачуКОтправке())
		И ДополнительныеСвойства[СвойствоПоставитьЗадачуКОтправке()]
		И Не ПометкаУдаления Тогда
		
		ПЗТ_ПланировщикЗадачТелеграмСервер.ПоставитьЗадачуВОчередьОтправки(Ссылка);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СвойствоПоставитьЗадачуКОтправке()

	Возврат "ПоставитьЗадачуКОтправке";
	
КонецФункции

Процедура УстановитьПризнакПоставитьЗадачуКОтправкеПередЗаписью()
	
	ИменаРеквизитовПровери = "Статус, Ответ";
	
	НовыеЗначенияРеквизитов = Новый Структура(ИменаРеквизитовПровери);
	ЗаполнитьЗначенияСвойств(НовыеЗначенияРеквизитов, ЭтотОбъект);
	
	СтарыеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Статус, Ответ");
	
	РеквизитыИзменены =  Не ОбщегоНазначения.КоллекцииИдентичны(НовыеЗначенияРеквизитов, СтарыеЗначенияРеквизитов);
	
	ДополнительныеСвойства.Вставить(СвойствоПоставитьЗадачуКОтправке(), РеквизитыИзменены);

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
